получается icmp это такой же протокол, служебный протокол TCP/IP.
Он не носит данные, единственное что он выполняет - передаёт сигналы и диагностику.
Например нам нужно узнать, живёт ли какое-нибудь устройство в нашей под сети,
тогда мы отправляем пакеты ICMP по сети.

Таким образом, другие устройства либо отвечают как-то, либо не отвечают, в общем
на любое поведение есть результат у IMCP.

ping и traceroute (забыл что это), целиком на них построены. как раз потому что с помощью них мы проверяем, есть ли возможность достучаться до этого устройства.

мне интересно, а зачем мы вообще скачивали nmap, и что это такое, если в итоге мы прсото пинганули сервер и получили TTL, у нас в пинге написано 13, => один маршрутизатор мы прошли.

что за nmap флаги? -PE, и т.д.

для чего эта вся штука нужна впринципе (при атаке)

первый делом мы идём в разведку (recon). мы проверяем есть ли вообще в сети какие-нибудь устройства, способные ответить на наш ICMP пакет.
а что значит дешевая карта сети? если ICMP только проверяет живо ли устройство, то как этот пакет знает про маски (подсети) и тем более ОС?

Про снаружи речь про то, что такая атака как я понимаю всем давно ясна, поэтому принято включать защиту, и просто блокировать ICMP пакеты вне локальной сети.
Внутри сети его почти всегда оставляют, потому что все думают что в их сеть не попадут, и почему бы не использовать ICMP.

Далее про TTL.
это одно из полей заголовка IP, это поле ставит отправитель по дефолту своей ОС.
Каждый роутер, который получает любой пакет как я понимаю, и поскольку это IP а всё по IP отправляется,
мы точно знаем что в пакете есть TTL, и он с каждым маршрутизатором всё меньше и меньше.
а если коммутатор? И как это, уничтожиться? а если в сети 65 маршрутизаторов, а система TTL=64. Пакет просто не дойдёт?
в любом случае если он уничтожился получим Time Exceeded.

Для чего это нужно?
Зачита от вечных петель на L3. Скажи, что значит L3?
Как я понимаю L3 это уровень маршрутизации.
Есть коммутатор L2 уровня, а есть L3. L3 поддерживает возможность маршуртизировать коммутаторами более низкого уровня.
А в чём вообще разница между маршрутизатором и коммутатором L3?
И почему в broadcast нет TTl? Потому что l2?
И что за петли вообще? Если обстрагироваться от той темы, я так понимаю, почему они вообще возникюат, если у нас в сети есть конечный адресат?
Или это именно случаи, в которых как бы есть какая-нибудь сеть в которую мы ICMP отправляем, и в этой сети этого айпишника просто нет, и роутеры просто друг к другу отправляют этот пакет витоге получаем петлю.

Теперь про защиту -
